---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.StartSlot
source: html/d79c6b0c-b933-c376-4301-a720c1436528.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.StartSlot Property

The Start Slot where the Electrical System is located in its panel.

## Syntax (C#)
```csharp
public int StartSlot { get; }
```

## Remarks
This property is used to retrieve the Start Slot of the Electrical System.